let handler = async (m, { conn }) => {
  let user = global.db.data.users[m.sender];
  let name = conn.getName(m.sender) || 'مستخدم';
  let taguser = '@' + m.sender.split("@")[0];
  let currentTime = new Date().toLocaleTimeString('ar-EG', { hour: '2-digit', minute: '2-digit' });

  let message = `*┃ 🖼️┊❝ قـسـم الـشـعـارات ❞┊🖼️┃*

*┃ 🎨┊❝ مرحباً ${taguser} في قسم الشعارات ❞┊🎨┃*
*┃🍡┊❝ تقدمه لك 𝑴𝑨𝑭𝑰𝑨 ❞┊🎀┃*
*╰───⊰ 🪄⊱───╮*

📌 *إختر نوع الشعار واكتب الأمر مع اسمك.*

*✦ ━━━━━ ❀🌸❀ ━━━━━ ✦*  
*╭──⊰ 🍬 قائمة الشعارات 🍬 ⊱──╮*
❤️ شعار قلب ⌜ .قلب-حب (الاسم) ⌟
🎄 شعار كريسماس ⌜ .كريسماس (الاسم) ⌟
💑 شعار زوجئ ⌜ .زوجئ (الاسم) ⌟
💢 شعار مشوش ⌜ .نص-مشوش (الاسم) ⌟
😔 شعار حزين ⌜ .حزين (الاسم) ⌟
🎮 شعار جيمينج ⌜ .جيمينج (الاسم) ⌟
🧍‍♂️ شعار وحيد ⌜ .وحيد (الاسم) ⌟
🐉 شعار درأغون بول ⌜ .درأغون_بول (الاسم) ⌟
💡 شعار نيون ⌜ .نيون (الاسم) ⌟
🐱 شعار قطة ⌜ .قطة (الاسم) ⌟
👧 شعار فتاة جيمر ⌜ .فتاة_جيمر (الاسم) ⌟
🎖️ شعار آرمي ⌜ .آرمي (الاسم) ⌟
🍥 شعار ناروتو ⌜ .ناروتو (الاسم) ⌟
🚀 شعار مستقبلي ⌜ .مستقبلي (الاسم) ⌟
☁️ شعار سحابه ⌜ .سحابه (الاسم) ⌟
😇 شعار ملاك ⌜ .ملاك (الاسم) ⌟
🌤️ شعار سماوي ⌜ .سماوي (الاسم) ⌟
🎨 شعار جرافيتي ثلاثي الأبعاد ⌜ .جرافيتي (الاسم) ⌟
💻 شعار ماتريكس ⌜ .ماتريكس (الاسم) ⌟
🩸 شعار رعب ⌜ .رعب (الاسم) ⌟
🪽 شعار أجنحة ⌜ .أجنحة (الاسم) ⌟
🏆 شعار ببجي ⌜ .ببجي (الاسم) ⌟
⚔️ شعار محأرب ⌜ .محأرب (الاسم) ⌟
👩‍🎤 شعار ببجي فتاة ⌜ .ببجي_فتاة (الاسم) ⌟
🕹️ شعار لول ⌜ .لول (الاسم) ⌟
👾 شعار امونج أس ⌜ .امونج_أس (الاسم) ⌟
🖼️ شعار غلاف لاعب ⌜ .غلاف_لاعب (الاسم) ⌟
🔥 شعار غلاف فري فاير ⌜ .غلاف_فريفاير (الاسم) ⌟
🐯 شعار فيديو تايجر ⌜ .فيديو_تايجر (الاسم) ⌟
🎬 شعار فيديو مقدمة ⌜ .فيديو_مقدمة (الاسم) ⌟
📹 شعار فيديو جيمينج ⌜ .فيديو_جيمينج (الاسم) ⌟
😿 شعار قط حزين ⌜ .قط_حزين (الاسم) ⌟
🐦 شعار تغريدة ⌜ .تغريدة (تعليق) ⌟

*╭━─━─━─❀🌸❀─━─━─━╮*  
*┃ 🍬┊ البوت: 𝑴𝑨𝑭𝑰𝑨 ┊🍬┃*  
*┃ 🍭┊ توقيع: 𝑨𝑯𝑴𝑨𝑫 ┊🍭┃*  
*╰━─━─━─❀🌸❀─━─━─━╯*`;

  const emojiReaction = '🪄';

  try {
    await conn.sendMessage(m.chat, { react: { text: emojiReaction, key: m.key } });

    await conn.sendMessage(m.chat, {
      image: { url: 'https://files.catbox.moe/ik8w8t.jpg' },
      caption: message,
      mentions: [m.sender]
    });
  } catch (error) {
    console.error("حدث خطأ أثناء إرسال رسالة الشعارات:", error);
    await conn.sendMessage(m.chat, { text: '❌ حدث خطأ أثناء إرسال قائمة الشعارات.' });
  }
};

handler.command = /^قائمة_الشعارات|شعارات$/i;
handler.tags = ['شعارات'];
handler.help = ['قائمة_الشعارات'];

export default handler;