let handler = async (m, { conn }) => {
  let taguser = '@' + m.sender.split("@")[0];

  // جلب بيانات الجروب
  let groupMetadata = m.isGroup ? await conn.groupMetadata(m.chat) : null;
  let groupName = groupMetadata ? groupMetadata.subject : 'غير متاح';
  let groupMembers = groupMetadata ? groupMetadata.participants.length : 'غير متاح';

  let message = `
*┃ 🍥┊❝ مـــرحبــــاً بـــكـ/ﻲ يـا ❪${taguser}❫ ❞┊🍥┃*  
*┃ 🏷┊❝ اسـم الـروم: ${groupName} ❞┊🏷┃*
*┃ 👥┊❝ الأعـضـاء: ${groupMembers} ❞┊👥┃*
*┃ 🍭┊❝ 𝐌𝐀𝐅𝐈𝐀 ❞┊🍭┃*  
*┃ 🍡┊❝ قـسـم المطور ❞┊🍡┃*  
*┃ 🎀┊❝ أوامر التحكم الخاصة بالمطور ❞┊🎀┃*  
*╰───⊰ 🍡❀⊱───╮*  
*✦ ━━━━━ ❀🌸❀ ━━━━━ ✦*

🍡 ⩺ ⌟بـريـم⌜  
🍡 ⩺ ⌟خـفـض-بـريـم⌜  
🍡 ⩺ ⌟الـمـمـيـزيـن⌜  
🍡 ⩺ ⌟فـحـص⌜  
🍡 ⩺ ⌟اـنـضـم⌜  
🍡 ⩺ ⌟عـقـد_الاـيـجـار⌜  
🍡 ⩺ ⌟اـنـهـاء_الـعـقـد⌜  
🍡 ⩺ ⌟اخـرج⌜  
🍡 ⩺ ⌟الـجـروبـات⌜  
🍡 ⩺ ⌟ارفـعـنـي⌜  
🍡 ⩺ ⌟هـاك⌜  
🍡 ⩺ ⌟اـسـحـبـهـا⌜  
🍡 ⩺ ⌟نـزلـهـم⌜  
🍡 ⩺ ⌟بـان⌜  
🍡 ⩺ ⌟رفـع-الـبـان⌜  
🍡 ⩺ ⌟بـانـشـات⌜  
🍡 ⩺ ⌟بـانـشـات_فـك⌜  
🍡 ⩺ ⌟الـمـبـنـديـن⌜  
🍡 ⩺ ⌟بـلـوك⌜  
🍡 ⩺ ⌟رفـع-الـبـلـوك⌜  
🍡 ⩺ ⌟الـبـلـوكـات⌜  
🍡 ⩺ ⌟حـظـر⌜  
🍡 ⩺ ⌟الـغـاء-الـحـظـر⌜  
🍡 ⩺ ⌟الـغـاء-الـمـنـع⌜  
🍡 ⩺ ⌟الـمـحـظـوريـن⌜  
🍡 ⩺ ⌟تـشـغـيـل⌜  
🍡 ⩺ ⌟ريـسـتـارت⌜  
🍡 ⩺ ⌟ايـقـاف⌜  
🍡 ⩺ ⌟رسـتـرهـم⌜  
🍡 ⩺ ⌟تـحـديـث⌜  
🍡 ⩺ ⌟اعـادة⌜  
🍡 ⩺ ⌟تـنـظـيـف⌜  
🍡 ⩺ ⌟تـنـظـيـف2⌜  
🍡 ⩺ ⌟ضـيـف_اكـسـبـي⌜  
🍡 ⩺ ⌟ضـيـف_جـواهـر⌜  
🍡 ⩺ ⌟ضـيـف-دولارات⌜  
🍡 ⩺ ⌟الاـمـردا⌜  
🍡 ⩺ ⌟الـمـلـف-دا⌜  
🍡 ⩺ ⌟جـيـب⌜  
🍡 ⩺ ⌟بـحـوث⌜  
🍡 ⩺ ⌟بـاتـش-اضـاف⌜  
🍡 ⩺ ⌟بـاتـش-حـذف⌜  
🍡 ⩺ ⌟بـاتـش-عـرض⌜  
🍡 ⩺ ⌟بـاتـش-تـعـديـل⌜  
🍡 ⩺ ⌟بـاتـش-الـكـل⌜  
🍡 ⩺ ⌟قـاعـده_بـيـانـات⌜  
🍡 ⩺ ⌟حـفـظ-الـصـوره⌜  
🍡 ⩺ ⌟الـمـسـتـخـدمـيـن⌜  
🍡 ⩺ ⌟الـان⌜  
🍡 ⩺ ⌟سـبـام⌜  
🍡 ⩺ ⌟خـفـي⌜  
🍡 ⩺ ⌟حـطـهـا_بـروفـايـل⌜  
🍡 ⩺ ⌟سـتـوري⌜  

*✦ ━━━━━ ❀🌸❀ ━━━━━ ✦*  
🍡 *┊ مـلاحظـة 🍡 : القسم تحت التطوير!*  
*╭━─━─━─❀🌸❀─━─━─━╮*  
*┃ 🍬┊ البوت: 𝑴𝑨𝑭𝐈𝐀 ┊🍬┃*  
*┃ 🍭┊ توقيع: 𝑨𝑯𝑴𝑨𝑫 ┊🍭┃*  
*╰━─━─━─❀🌸❀─━─━─━╯*`;

  try {
    await conn.sendMessage(m.chat, { react: { text: '🤖', key: m.key } });

    await conn.sendMessage(m.chat, {
      image: { url: 'https://files.catbox.moe/zzscpq.jpg' },
      caption: message,
      mentions: [m.sender]
    });
  } catch (error) {
    console.error("Error sending message:", error);
    await conn.sendMessage(m.chat, { text: '❌ حدث خطأ أثناء إرسال القائمة.' });
  }
};

handler.command = /^(قائمتي)$/i;
handler.exp = 50;
handler.fail = null;

export default handler;